app/controllers/public_controller.rb

INSERT INTO "comments" ("author", "author_url", "body", "content", "created_at", "post_id", "spam_message", "spam_status", "updated_at", "user_ip", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_comment
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save