app/views/public/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
---
        Comments:<br />
        <% post.comments.each do |comment| %>